"""Εύρεση όλων των τέλειων αριθμών στο διάστημα 1 έως 10.000

Τέλειος λέγεται ένας φυσικός αριθμός όταν το άθροισμα των διαιρετών του, εκτός του αριθμού, 
είναι ίσο τον αριθμό δηλ. ο n είναι τέλειoς αν και μόνο αν σ(n) = 2n. 
Ο μικρότερος τέλειος αριθμός είναι ο 6. 
Οι διαιρέτες του 6 είναι οι 1, 2, 3 και το άθροισμα αυτών είναι ίσο με 6."""


def is_perfect(x):
    s = 0
    for i in range(1, x):
        if x % i == 0:
            s += i
    return s == x


for x in range(1, 10_001):
    if is_perfect(x):
        print(x)
