# Πρόγραμμα ελέγχου θετικού ακέραιου αριθμού από το χρήστη
print('\nΕΛΕΓΧΟΣ ΘΕΤΙΚΟΥ ΑΚΕΡΑΙΟΥ ΑΡΙΘΜΟΥ')
print('================================')

while True:
    try:
        x = int(input('\nΔώσε έναν θετικό ακέραιο αριθμό:'))
        if x<0:
            print('Ο αριθμός',x, 'δεν είναι θετικός\n')
        elif x>0:
            print('Ο αριθμός',x, 'είναι θετικός')
        elif x==0:
            print('\n\nΔώσατε μηδέν (0) \nΕΞΟΔΟΣ ΑΠΟ ΤΟ ΠΡΟΓΡΑΜΜΑ')
            print('-------------------------')
            break
    except:
        print('Το δεδομένο που εισαγάγατε δεν είναι ακέραιος αριθμός')
