# ΠΑΡΑΔΕΙΓΜΑ ΑΠΛΟΥ ΕΛΕΓΧΟΥ - ΣΥΝΘΗΚΕΣ (Conditions) με επανάληψη ερώτησης
while True:
    age=input('\nΠόσο χρονών είσαι; ')
    if len(age)==0: # Αν ο χρήστης πατήσει Enter θα γίνει έξοδος από το πρόγραμμα
        print("\n --- Τέλος προγράμματος---")
        break # break or continue or fail
    if int(age)>=18:
        print('Είσαι ενήλικας') # Αυτή γραμμή θα εμφανιστεί μόνο αν ισχύει η συνθήκη
    else:
        print('Είσαι ΑΝΗΛΙΚΟΣ !')
    print('='*20) # Αυτή η γραμμή θα εκτελεστεί σε κάθε περίπτωση 