x = -1 # αρχικοποίηση
while (x <= 0): # αμυντικός προγραμματισμός ώστε να είναι θετικός αριθμός
    try:        # Χρήση του try ως αμυντικός προγραμματισμός για είσοδο
        x = int(input("Παρακαλώ εισάγετε θετικό ακέραιο αριθμό: "))
    except ValueError:  # Σε περίπτωση μη έγκυρης εισόδου
        print("Η είσοδος δεν αντιστοιχεί σε θετικό ακέραιο αριθμό.")
        continue
 
y = str(x)  	# μετατροπή μεταβλητής
total = 0       # αρχικοποίηση αθροίσματος
for element in y: # διατρέχουμε τα ψηφία
    total = total + int(element)    # ενημέρωση του αθροίσματος
print(total)    # εκτύπωση αθροίσματος

